research/visualization_methods/outputs/Contextual Bandits__conditional_regression/conditional_regression.dot
digraph G {
  "413" [label="413"];
  "48" [label="48"];
  ":predictive" [label=":predictive"];
  ":τ" [label=":τ"];
  "Categorical" [label="Categorical"];
  "Dict" [label="Dict"];
  "Float64" [label="Float64"];
  "GammaShapeRate" [label="GammaShapeRate"];
  "Int" [label="Int"];
  "KeepLast" [label="KeepLast"];
  "MeanField" [label="MeanField"];
  "MvNormalMeanPrecision" [label="MvNormalMeanPrecision"];
  "NormalMixture" [label="NormalMixture"];
  "StableRNG" [label="StableRNG"];
  "VectorFloat64" [label="VectorFloat64"];
  "act" [label="act"];
  "actual_context" [label="actual_context"];
  "actual_rewards" [label="actual_rewards"];
  "analyze_doubly_robust_uplift" [label="analyze_doubly_robust_uplift"];
  "argmax" [label="argmax"];
  "arm_counts_predictive" [label="arm_counts_predictive"];
  "arm_counts_random" [label="arm_counts_random"];
  "arm_counts_thompson" [label="arm_counts_thompson"];
  "arm_distribution_plot" [label="arm_distribution_plot"];
  "arm_idx" [label="arm_idx"];
  "arm_vals" [label="arm_vals"];
  "arms" [label="arms"];
  "augmented_context" [label="augmented_context"];
  "calculate_improvements" [label="calculate_improvements"];
  "chosen_arm" [label="chosen_arm"];
  "colors" [label="colors"];
  "compute_reward" [label="compute_reward"];
  "constraints" [label="constraints"];
  "context" [label="context"];
  "context_dim" [label="context_dim"];
  "context_mean" [label="context_mean"];
  "context_precision" [label="context_precision"];
  "context_to_mvnormal" [label="context_to_mvnormal"];
  "cumsum" [label="cumsum"];
  "cumul_predictive" [label="cumul_predictive"];
  "cumul_random" [label="cumul_random"];
  "cumul_thompson" [label="cumul_thompson"];
  "current_context" [label="current_context"];
  "data_idx" [label="data_idx"];
  "direct_method" [label="direct_method"];
  "dot" [label="dot"];
  "end" [label="end"];
  "expected_rewards" [label="expected_rewards"];
  "final_predictive_avg" [label="final_predictive_avg"];
  "final_random_avg" [label="final_random_avg"];
  "final_thompson_avg" [label="final_thompson_avg"];
  "for" [label="for"];
  "history" [label="history"];
  "i" [label="i"];
  "idx" [label="idx"];
  "improvements" [label="improvements"];
  "in" [label="in"];
  "inferred_arm_mean" [label="inferred_arm_mean"];
  "inferred_arm_posterior" [label="inferred_arm_posterior"];
  "inferred_arms" [label="inferred_arms"];
  "k" [label="k"];
  "latent_context" [label="latent_context"];
  "length" [label="length"];
  "max" [label="max"];
  "mean" [label="mean"];
  "mse_arms" [label="mse_arms"];
  "n" [label="n"];
  "n_arms" [label="n_arms"];
  "n_contexts" [label="n_contexts"];
  "n_epochs" [label="n_epochs"];
  "noise_sd" [label="noise_sd"];
  "observe" [label="observe"];
  "palette" [label="palette"];
  "past_rewards" [label="past_rewards"];
  "plan" [label="plan"];
  "plot_arm_distribution" [label="plot_arm_distribution"];
  "posteriors" [label="posteriors"];
  "pred_std" [label="pred_std"];
  "prediction_mse" [label="prediction_mse"];
  "predictive_strategy" [label="predictive_strategy"];
  "predictive_vs_random" [label="predictive_vs_random"];
  "println("$(lpad(i, 6)) | $(rpad(round(actual, digits" [label="println("$(lpad(i, 6)) | $(rpad(round(actual, digits"];
  "println("Test       | $(rpad(round(test_mse, digits" [label="println("Test       | $(rpad(round(test_mse, digits"];
  "println("Training   | $(rpad(round(train_mse, digits" [label="println("Training   | $(rpad(round(train_mse, digits"];
  "priors" [label="priors"];
  "priors_rng" [label="priors_rng"];
  "q(chosen_arm)" [label="q(chosen_arm)"];
  "q(latent_context)" [label="q(latent_context)"];
  "q_context" [label="q_context"];
  "rand" [label="rand"];
  "returnvars" [label="returnvars"];
  "reward" [label="reward"];
  "reward_variances" [label="reward_variances"];
  "rewards" [label="rewards"];
  "rewards_data" [label="rewards_data"];
  "rng" [label="rng"];
  "run_bandit_simulation" [label="run_bandit_simulation"];
  "select_context" [label="select_context"];
  "softdot" [label="softdot"];
  "sqrt" [label="sqrt"];
  "strategies" [label="strategies"];
  "target_rewards" [label="target_rewards"];
  "target_strategy" [label="target_strategy"];
  "theta_sample" [label="theta_sample"];
  "thompson_vs_random" [label="thompson_vs_random"];
  "train_rewards" [label="train_rewards"];
  "undef" [label="undef"];
  "window_length" [label="window_length"];
  "zeros" [label="zeros"];
  "τ" [label="τ"];
  "413" -> "println("$(lpad(i, 6)) | $(rpad(round(actual, digits";
  "48" -> "println("Test       | $(rpad(round(test_mse, digits";
  "48" -> "println("Training   | $(rpad(round(train_mse, digits";
  "Categorical" -> "chosen_arm";
  "Categorical" -> "q(chosen_arm)";
  "Dict" -> "posteriors";
  "Dict" -> "priors";
  "Dict" -> "rewards";
  "Float64" -> "rewards_data";
  "GammaShapeRate" -> ":τ";
  "Int" -> "arm_counts_predictive";
  "Int" -> "arm_counts_random";
  "Int" -> "arm_counts_thompson";
  "KeepLast" -> "returnvars";
  "MeanField" -> "constraints";
  "MvNormalMeanPrecision" -> "q(latent_context)";
  "NormalMixture" -> "arm_vals";
  "StableRNG" -> "priors_rng";
  "StableRNG" -> "rng";
  "VectorFloat64" -> "context_mean";
  "VectorFloat64" -> "context_precision";
  "act" -> "chosen_arm";
  "actual_context" -> "q_context";
  "actual_rewards" -> "prediction_mse";
  "analyze_doubly_robust_uplift" -> "predictive_vs_random";
  "analyze_doubly_robust_uplift" -> "thompson_vs_random";
  "argmax" -> "chosen_arm";
  "arm_idx" -> "rewards";
  "arm_vals" -> "past_rewards";
  "arm_vals" -> "reward";
  "arms" -> "mse_arms";
  "arms" -> "rewards";
  "augmented_context" -> "expected_rewards";
  "calculate_improvements" -> "improvements";
  "compute_reward" -> "rewards";
  "context" -> "rewards";
  "context_dim" -> "history";
  "context_dim" -> "posteriors";
  "context_to_mvnormal" -> "latent_context";
  "context_to_mvnormal" -> "q_context";
  "cumsum" -> "cumul_predictive";
  "cumsum" -> "cumul_random";
  "cumsum" -> "cumul_thompson";
  "current_context" -> "latent_context";
  "dot" -> "expected_rewards";
  "end" -> "chosen_arm";
  "end" -> "inferred_arms";
  "expected_rewards" -> "chosen_arm";
  "for" -> "mse_arms";
  "history" -> "arm_distribution_plot";
  "history" -> "cumul_predictive";
  "history" -> "cumul_random";
  "history" -> "cumul_thompson";
  "history" -> "final_predictive_avg";
  "history" -> "final_random_avg";
  "history" -> "final_thompson_avg";
  "history" -> "improvements";
  "history" -> "n_arms";
  "history" -> "predictive_vs_random";
  "history" -> "thompson_vs_random";
  "i" -> "mse_arms";
  "i" -> "pred_std";
  "in" -> "mse_arms";
  "inferred_arm_posterior" -> "inferred_arm_mean";
  "k" -> "theta_sample";
  "latent_context" -> "past_rewards";
  "latent_context" -> "reward";
  "length" -> "n_arms";
  "length" -> "n_epochs";
  "max" -> "data_idx";
  "mean" -> "augmented_context";
  "mean" -> "direct_method";
  "mean" -> "final_predictive_avg";
  "mean" -> "final_random_avg";
  "mean" -> "final_thompson_avg";
  "mean" -> "inferred_arm_mean";
  "mean" -> "inferred_arms";
  "mean" -> "mse_arms";
  "mean" -> "prediction_mse";
  "n" -> "arm_vals";
  "n" -> "past_rewards";
  "n_arms" -> "arm_counts_predictive";
  "n_arms" -> "arm_counts_random";
  "n_arms" -> "arm_counts_thompson";
  "n_arms" -> "chosen_arm";
  "n_arms" -> "expected_rewards";
  "n_arms" -> "history";
  "n_arms" -> "q(chosen_arm)";
  "n_arms" -> "strategies";
  "n_contexts" -> "current_context";
  "n_contexts" -> "history";
  "n_epochs" -> "history";
  "noise_sd" -> "rewards";
  "observe" -> "rewards";
  "palette" -> "colors";
  "plan" -> "strategies";
  "plot_arm_distribution" -> "arm_distribution_plot";
  "posteriors" -> "priors";
  "posteriors" -> "strategies";
  "posteriors" -> "theta_sample";
  "predictive_strategy" -> ":predictive";
  "rand" -> "chosen_arm";
  "rand" -> "idx";
  "rand" -> "theta_sample";
  "reward_variances" -> "pred_std";
  "rng" -> "chosen_arm";
  "rng" -> "current_context";
  "rng" -> "idx";
  "rng" -> "rewards";
  "rng" -> "strategies";
  "rng" -> "theta_sample";
  "run_bandit_simulation" -> "history";
  "select_context" -> "current_context";
  "softdot" -> "past_rewards";
  "softdot" -> "reward";
  "sqrt" -> "pred_std";
  "strategies" -> "chosen_arm";
  "strategies" -> "rewards";
  "target_rewards" -> "direct_method";
  "target_rewards" -> "n_epochs";
  "target_strategy" -> "n_arms";
  "theta_sample" -> "expected_rewards";
  "train_rewards" -> "rewards_data";
  "undef" -> "context_mean";
  "undef" -> "context_precision";
  "window_length" -> "data_idx";
  "window_length" -> "history";
  "zeros" -> "arm_counts_predictive";
  "zeros" -> "arm_counts_random";
  "zeros" -> "arm_counts_thompson";
  "zeros" -> "expected_rewards";
  "τ" -> "past_rewards";
  "τ" -> "reward";
}
